chitrung218ulsan/contiki-pms-project/core/net/rime/device-module-cc26xx.c
/*
 * device-module-cc26xx.c
 *
 *  Created on: Jun 10, 2016
 *      Author: user
 */
#include "contiki.h"
#include "net/rime/rime.h"
#include "net/netstack.h"
#include <string.h>
#include <stdio.h>
#include <stddef.h>
#include "sys/rtimer.h"

#include "device-module-cc26xx.h"
#include "net/mac/contikimac/contikimac.h"

#include "net/rime/ftsp.h"
#include "net/linkaddr.h"
#include "sys/clock.h"

#include "net/mac/nullrdc.h"

#ifdef USE_CC2630_CONFIG
#define USE_CC2630 USE_CC2630_CONFIG
#else USE_CC2630 0
#endif

#if USE_CC2630
#include "cc26xx_adc.h"
#include "rf-core/rf-ble.h"

#include "ti-lib.h"
#endif


#define DEVICE_MODULE_CYCLE_TIME	2*CLOCK_SECOND


extern uint32_t nullrdc_rm_cycle;
extern uint32_t nullrdc_pms_count_sent;

static void broadcast_recv(struct broadcast_conn *c, const linkaddr_t *from);

static CC_CONST_FUNCTION struct broadcast_callbacks module_device_broadcast_call = {broadcast_recv};

struct broadcast_conn broadcast;

#if PMS_SCD || TEST_CODE
//void device_module_PMS_send_command_to_RM(uint8_t commandType);
//void device_module_PMS_send_data_to_SRT();
//static void device_module_rm_ack_expire_handle (void *ptr);
//static void ctimer_turn_off_air_exp_func(void*ptr);
static void device_module_pms_send_adv_time_syn();
static void device_module_set_period_first(void *ptr);
static void device_module_set_period_general(void*ptr);
static void device_module_PMS_send_command_to_RM_directly(uint8_t commandType);
static void device_module_reset_sync_period_c(void *ptr);
static void device_module_pms_send_adv_time_resyn();
static void device_module_send_adv_sync_2(void *ptr);
static void check_current_off_experation_func(void*ptr);
static void check_current_on_experation_func(void*ptr);
#endif /*PMS_SCD || TEST_CODE */

#if HD_SCD
static void device_module_check_PIR();
static int16_t q_div(int16_t a,int16_t b);
static int16_t q_mul(int16_t a,int16_t b);
static uint8_t device_module_process_data_PIR (int16_t *PIRDataset);
#endif



#if RM_SCD
static void device_module_set_period_first(void *ptr);
static void device_module_set_period_general(void*ptr);
#endif /*RM_SCD*/



// Variable


/*
 * Function:device_module_open
 */


#if HD_SCD

#define MW_FFT_SIZE 128
#define PIR_DATA_POINT	50
uint16_t cycleCount ;
extern uint8_t nullrdc_hd_try_nums;


static int16_t HD_MWre[MW_FFT_SIZE];

static int16_t HD_MWimg[MW_FFT_SIZE];

static int16_t FFT_buffer[MW_FFT_SIZE];

static int16_t PIR_buffer[PIR_DATA_POINT];

static uint8_t device_module_HD_check;
static uint8_t device_module_curState;
static uint8_t device_module_MW_is_checking;


static const int16_t check_max_no_movement[20] =
{
	700, 400, 200, 125, 70, 40, 30, 30, 20, 15, 15, 10, 5, 5, 6, 3, 3, 3, 2, 2

};


PROCESS(MW_check_process,"Test_MW_check_process");
//PROCESS(FFT_process,"Test_FFT_check_process");
//PROCESS(ADC_process,"Test_ADC_check_process");

PROCESS_THREAD(MW_check_process,ev,data)
{

	PROCESS_BEGIN();
	printf("start MW_check_process thread \n");
	static int i = 0;
	static uint8_t check_count = 0;
	static uint8_t FFT_HD_movement_detect = 0;
	while(1)
	{
		PROCESS_WAIT_EVENT();

#if USE_CC2630
		check_count = 0;
		FFT_HD_movement_detect = 0;
		device_module_MW_is_checking = 1;

		// provide power for PIR
		ti_lib_ioc_pin_type_gpio_output(MW_CTRL_POWER_IOID);

		ti_lib_gpio_pin_write(MW_CTRL_POWER_PIN, 1);

		// start ADC
		cc26xx_adc_init(ADC_COMPB_IN_AUXIO5); // DIO25 for MW

		for(check_count = 0;check_count < 10;check_count ++)
		{
			for(i=0;i<128;i++)
			{
				cc26xx_adc_start_convert();

				HD_MWre[i] = cc26xx_get_adc_value();
			}

			cc26xx_adc_stop();

			// Cut off power for PIR

			ti_lib_gpio_pin_write(MW_CTRL_POWER_PIN, 0);

			// Processing FFT
			for(i = 0;i < MW_FFT_SIZE;i++)
			{

				FFT_buffer[i] = -128 + (HD_MWre[i] >> 4);

			}

			ifft(FFT_buffer, HD_MWimg, MW_FFT_SIZE);

			for (i = 1; i < MW_FFT_SIZE/2; i++)
			{
				if(i <=20)
				{
					if(check_max_no_movement[i-1] < FFT_buffer[i] )
					{
						//check_max_no_movement[i] = FFT_buffer[i];
						FFT_HD_movement_detect ++;
						//printf("compare i: %d ,amplitude: %d \n",i,FFT_buffer[i]);
					}
					//printf("compare i: %d ,amplitude: %d \n",i,check_max_no_movement[i]);
				}
			}


			if( FFT_HD_movement_detect >=1 )
			{
				printf("FFT done ->>>>>>> movement \n");
				break;
			}
			else
			{
				printf("FFT done ->>>>>>> no movement \n");
			}
		} // for


		device_module_MW_is_checking = 0;

		if(FFT_HD_movement_detect >=1)
		{
			device_module_curState = E_STATE;
			device_module_HD_check = 30;

		}
		else
		{
			device_module_curState = NE_STATE;
		}
#endif
	}
	PROCESS_END();
}

static void device_module_check_PIR()
{
#if USE_CC2630
	int i = 0;

	uint8_t PIR = 0;


	// provide power for PIR
	ti_lib_ioc_pin_type_gpio_output(PIR_CTRL_POWER_IOID);

	ti_lib_gpio_pin_write(PIR_CTRL_POWER_PIN, 1);


	// Get data of PIR
	cc26xx_adc_init(ADC_COMPB_IN_AUXIO4); // DIO26 for PIR

	for(i=0;i<PIR_DATA_POINT;i++)
	{
		cc26xx_adc_start_convert();

		PIR_buffer[i] = cc26xx_get_adc_value();
	}

	//stop ADC
	cc26xx_adc_stop();
	//Cut off power for PIR
	ti_lib_gpio_pin_write(PIR_CTRL_POWER_PIN, 0);

	PIR = device_module_process_data_PIR(PIR_buffer);

	if(PIR == 1)
	{

		device_module_HD_check = 30;
		if(device_module_curState == NE_STATE)
		{
			//send to pms from NE_STATE to E_STATE
			device_module_curState = E_STATE;
			device_module_HD_send_status_to_PMS_diretly(device_module_curState);
		}
		else
		{
			//ctimer_stop(&turnOffCPUAndRadioTimer);
			//device_module_off_CPU_Radio(NULL);
		}
	}
	else if(PIR == 0 && device_module_HD_check > 0)
	{
		device_module_HD_check -= 1;

		if(device_module_HD_check == 0 && device_module_curState == E_STATE)
		{
			printf("At device_module_check_PIR, PIR: 0, device_module_HD_check: 0 \n");
			// send status to pms from E_STATE to NE_STATE
			//call PMW to check
			process_post_synch(&MW_check_process,PROCESS_EVENT_CONTINUE,NULL);

		}
		else
		{
			//ctimer_stop(&turnOffCPUAndRadioTimer);
			//device_module_off_CPU_Radio(NULL);
		}
	}
#endif
}
/*
 *
 *
 */
static int16_t q_div(int16_t a,int16_t b)
{
	int16_t result;
	int32_t temp;
	temp = (int32_t)a << 3;
	if((temp >=0 && b >=0) || (temp <0 && b <0))
	{
		temp += b/2;
	}
	else
		temp -= b/2;

	result = (int16_t)(temp/b);

	return result;
}
/*
 *
 *
 */
static int16_t sat16(int32_t x)
{
	if(x > 32768)
		return 32768;
	else if(x < -32768)
		return -32768;
	else
		return (int16_t)x;
}
/*
 *
 */
static int16_t q_mul(int16_t a,int16_t b)
{
	int16_t result;
	int32_t temp;
	temp = (int32_t)a * (int32_t)b;
	temp = temp + 4;
	temp = temp >> 3;
	result = sat16(temp);

	return result;
}
/*
 *
 *
 */
static uint8_t device_module_process_data_PIR (int16_t *PIRDataset)
{
	uint8_t PIR=0;

	uint8_t outCnt = 0;

