chitrung218ulsan/contiki-pms-project/core/net/rime/device-module-cc26xx.c
	int i;

	int16_t tempPIR = 0;
	int16_t tempPIR1 = 0;
	int16_t temp = 0;

	for(i=0 ; i<50;i++)
	{
		temp = *(PIRDataset++);

		tempPIR = q_div(temp,4095);

		tempPIR1 = q_mul(tempPIR,20);

		//printf("At device_module_human_detection_test_PIR_1, data: %d, q_div: %d, q_mul:%d \n",temp,tempPIR,tempPIR1);

		if(tempPIR1 < 1)
		{
			outCnt++;
		}
	}
	if(outCnt > 5)
	{
		PIR = 1;
	}
	printf("PIR Out: %d \n",PIR);
	return PIR;
}
/*
 *
 */
void device_module_set_period_general(void*ptr)
{
	cycleCount += 1;
	if(cycleCount % 300 == 0)
	{
		//TurnOnCC2420();
		ctimer_stop(&periodTimer);
		ftsp_reset_seqNum();
		return;
	}
	//TurnOnCC2420();
	//device_module_HD_send_status_to_PMS_diretly(1);

	if(device_module_MW_is_checking == 0)
	{
		ctimer_reset(&periodTimer);

		device_module_check_PIR();

		//process_post(&MW_check_process,PROCESS_EVENT_CONTINUE,NULL);

	}
	else
	{
		ctimer_reset(&periodTimer);
	}
}
void device_module_set_period_first(void *ptr)
{
	ctimer_set( &periodTimer, DEVICE_MODULE_CYCLE_TIME, device_module_set_period_general, NULL);
}

void device_module_HD_send_status_to_PMS_diretly(uint8_t roomStatus)
{
	//TurnOnCC2420(); for chip CC2420
	// Turn on radio chip of CC2630
	nullrdc_hd_try_nums =0;
	struct hd_message_str messagePkt;
	messagePkt.frameType = HD_ROOM_STATUS;
	messagePkt.nodeId = linkaddr_node_addr.u8[0];
	messagePkt.roomStatus = roomStatus;
	if(DEBUG_ENABLE)
	{
		printf("Human-detection: HD node %d sends room status to PMS node\n",linkaddr_node_addr.u8[0]);
	}
	nullRdc_HD_send_room_status_to_PMS(&messagePkt,sizeof(struct hd_message_str));
}

void device_module_off_CPU_Radio(void *ptr)

{


	/*
	TurnOFFCC2420();
	//_BIS_SR(GIE | SCG0 | SCG1 | CPUOFF);
	_BIS_SR(LPM3_bits);
	printf("HD node %d turns off Radio and CPU, cycle: %d \n",rimeaddr_node_addr.u8[0],cycleCount);
	*/

	//To do for new chip CC2630
}

#endif /* HD_SCD */

#if PMS_SCD || TEST_CODE

extern uint8_t nullrdc_pms_try_nums;
uint16_t count_PMS = 0;
uint16_t cycleCount = 0;

static void device_module_pms_send_adv_time_resyn()
{
	struct pms_message_adv_time_syn messagePkt;
	messagePkt.frameType = PMS_ADV_TIME_SYN;
	messagePkt.nodeId = linkaddr_node_addr.u8[0];
	messagePkt.startSynTime = get_global_time() + 1*CLOCK_SECOND;
	timeStamp = messagePkt.startSynTime;

	ctimer_stop(&periodTimer_1);
	ctimer_set(&periodTimer_1, 1*CLOCK_SECOND, device_module_set_period_first, NULL);

	packetbuf_copyfrom(&messagePkt, sizeof(struct pms_message_adv_time_syn));

	broadcast_send(&broadcast);

	ctimer_set(&periodAdvSyncTimer, 50, device_module_send_adv_sync_2, NULL);

	if(DEBUG_ENABLE)
	{
		printf("PMS node %d sends ADV Time SYN at globalTime: %d \n",linkaddr_node_addr.u8[0],
				get_global_time());
	}

}


static void device_module_reset_sync_period_c(void *ptr)
{

	if(ftsp_get_seqNum() <= 15)
	 {
			ftsp_send();
			ctimer_set(&periodSyncTimer, 50, device_module_reset_sync_period_c, NULL);
	 }
	 else
	 {
		  printf("Start send ADV SYNC \n");
		  device_module_pms_send_adv_time_resyn();
	 }
}

static void device_module_set_period_general(void*ptr)
{
	rtimer_clock_t rtime_now;
	rtime_now = RTIMER_NOW();
	ctimer_reset(&periodTimer);
	//only send command to RM within first 50 ms
	dutyCycleOn = 1;
	// call function to send command to RM

	// For test only periodically, Mungtv
	//device_module_PMS_send_command_to_RM_directly(PMS_COMMAND_IR_OFF_TV_REQ);
	count_PMS++;
	cycleCount ++;

	if(cycleCount % 300 == 0)
	{
		if(DEBUG_ENABLE)
		{
			printf("Cycle Count Value: %u \n",cycleCount);
		}
		ctimer_stop(&periodTimer);
		ftsp_reset_seqNum();
		ctimer_set(&periodSyncTimer, 25, device_module_reset_sync_period_c, NULL);
		return;
	}


	if(offCommand)
	{
		//ctimer_set(&ctimer_PMS_send_command_to_RM,2,ctimer_PMS_send_command_to_RM_exp_func,NULL);
		device_module_PMS_send_command_to_RM_directly(PMS_COMMAND_IR_OFF_TV_REQ);
		offCommand = 0;

		//set timer to check current
		ctimer_set(&check_currren_off_timer,32*CLOCK_SECOND,check_current_off_experation_func,NULL);
	}
	else if(onCommand)
	{
		device_module_PMS_send_command_to_RM_directly(PMS_COMMAND_IR_ON_TV_REQ);
		onCommand = 0;
		//set timer to check current
		ctimer_set(&check_currren_on_timer,3*CLOCK_SECOND,check_current_on_experation_func,NULL);
	}

	//ctimer_set(&turnOffCPUAndRadioTimer,cycleTime,device_module_off_CPU_Radio,NULL);

	if(DEBUG_ENABLE){
		//printf("PMS node Id: %d wakes up, cycle: %u,send cmd %u at globalTime: %u \n", rimeaddr_node_addr.u8[0], cycleCount, nullrdc_pms_count_sent, get_global_time());
	}
}


static void device_module_set_period_first(void *ptr)
{
	ctimer_set( &periodTimer, DEVICE_MODULE_CYCLE_TIME, device_module_set_period_general, NULL);
}

static void device_module_send_adv_sync_2(void *ptr)
{
	if(synSeq >= 3)
	{
		synSeq = 0;
		ctimer_stop(&periodAdvSyncTimer);
		return;
	}
	synSeq++;

	struct pms_message_adv_time_syn messagePkt;
	messagePkt.frameType = PMS_ADV_TIME_SYN;
	messagePkt.nodeId = linkaddr_node_addr.u8[0];
	messagePkt.startSynTime = timeStamp;

	packetbuf_copyfrom(&messagePkt, sizeof(struct pms_message_adv_time_syn));

	broadcast_send(&broadcast);

	if(DEBUG_ENABLE)
	{
		printf("PMS node %d sends ADV Time SYN at globalTime: %d \n",linkaddr_node_addr.u8[0],
				get_global_time());
	}

	ctimer_set(&periodAdvSyncTimer, 50, device_module_send_adv_sync_2, NULL);
}

static void device_module_pms_send_adv_time_syn()
{
	struct pms_message_adv_time_syn messagePkt;
	messagePkt.frameType = PMS_ADV_TIME_SYN;
	messagePkt.nodeId = linkaddr_node_addr.u8[0];
	messagePkt.startSynTime = get_global_time() + 10*CLOCK_SECOND;

	timeStamp = messagePkt.startSynTime;

	ctimer_stop(&periodTimer_1);
	ctimer_set(&periodTimer_1, 10*CLOCK_SECOND, device_module_set_period_first, NULL);

	if(DEBUG_ENABLE)
	{
		printf("PMS node %d sends ADV Time SYN at globalTime: %d \n",linkaddr_node_addr.u8[0],
				get_global_time());
	}

	packetbuf_copyfrom(&messagePkt, sizeof(struct pms_message_adv_time_syn));

	broadcast_send(&broadcast);

	ctimer_set(&periodAdvSyncTimer, 50, device_module_send_adv_sync_2, NULL);
}


void device_module_PMS_update_Room_Status_From_HD(void *message){

	if(DEBUG_ENABLE)
	{
		printf("PMS_SCD %d receives HD_ROOM_STATUS from HD node %d, room_status:%d \n",
				linkaddr_node_addr.u8[0],pms_hd_NodeId,pms_room_status);
	}

	struct hd_message_str *messagePkt;
	messagePkt = (struct hd_message_str*) message;
	pms_hd_NodeId = messagePkt->nodeId;

	if(messagePkt->roomStatus == 2)
	{
		/*// Do nothing depending on the status of PMC
		if(!(PMC_SCD.Status == STANDBY || PMC_SCD.Status == OPERATING|| PMC_SCD.Status == MEASURING))
		{
			printf("PMC receive HD turn off command, do nothing at status %d\n", PMC_SCD.Status);
			return;
		}
		*/
#if PMS_SCD_NO_REMOTE

		printf("PMC connects to device without remove ->>>>> turn off device without remote \n");

		//call function to cut off the power

		//ProcessCutOffMode();
#endif
		//if connecting with device having remote

