chitrung218ulsan/contiki-pms-project/core/net/rime/device-module-cc26xx.c
		//send command to RM to off device and cutoff

#if PMS_SCD_REMOTE_TV

		offCommand = 1;
#endif

#if PMS_SCD_REMOTE_AIR

		//device_module_PMS_send_command_to_RM(PMS_COMMAND_IR_OFF_AIR_REQ);

		//set timer to cut off air since the air is turned off by TV PMS
		offCommand = 1;

#endif

	}
	pms_room_status = messagePkt->roomStatus;
}

static void device_module_PMS_send_command_to_RM_directly(uint8_t commandType)
{
	struct pms_command_message_str messagePkt;
	messagePkt.frameType = commandType;
	messagePkt.nodeId = linkaddr_node_addr.u8[0];


	nullrdc_pms_try_nums = 0;
	if(DEBUG_ENABLE)
	{
		printf("PMS node %d sends command: %d to RM node\n",linkaddr_node_addr.u8[0],commandType);
	}
	uint8_t ret = nullRdc_PMS_send_command_to_RM(&messagePkt,sizeof(struct pms_command_message_str));
	if(ret != RADIO_TX_OK)
	{
		if(commandType == PMS_COMMAND_IR_OFF_TV_REQ)
		{
			offCommand = 1;
		}
	}

	if(DEBUG_ENABLE)
	{
		//printf("PMS node %d sends command: %d to RM node\n",linkaddr_node_addr.u8[0],commandType);
	}
}


static void check_current_off_experation_func(void*ptr)
{
	// Check the status of device wheather it is off or not
	/*
	if(PMC_SCD.Status != CUTOFF)
	{
		//send command to turn off once more time
		offCommand = 1;
	}
	*/
}
static void check_current_on_experation_func(void *ptr)
{
	// Check the status of device wheather it is on or not
/*
	if(PMC_SCD.Status == CUTOFF)
	{

		onCommand = 1;
	}
*/
}

#endif /*PMS_SCD */


#if RM_SCD

    uint16_t cycleCount ;


	void device_mode_RM_send_IR_TV(uint8_t commandType)
	{
		if(commandType == PMS_COMMAND_IR_OFF_TV_REQ)
		{
			// call function to send IR to turn on or turn off device
			//TVControl();
		}
		else if(commandType == PMS_COMMAND_IR_ON_TV_REQ){

			// call function to send IR to turn on or turn off device
			//TVControl();
		}
		if(DEBUG_ENABLE)
		{
			printf("RM node %d send IR TV \n",linkaddr_node_addr.u8[0]);
		}
	}

	static void device_module_set_period_first(void *ptr)
	{
		ctimer_set( &periodTimer, DEVICE_MODULE_CYCLE_TIME, device_module_set_period_general, NULL);
	}

	static void device_module_set_period_general(void*ptr)
	{


		//TurnOnCC2420();
		//rtimer_set(&radioOnTimer, RTIMER_NOW() + 1, 1, (rtimer_callback_t)device_module_set_timer_radio_on, NULL);
		ctimer_reset(&periodTimer);
		cycleCount = cycleCount + 1;
		nullrdc_rm_cycle = cycleCount;

		if(cycleCount % 300 == 0)
		{
			ctimer_stop(&periodTimer);
			ftsp_reset_seqNum();
			return;
		}


		if(DEBUG_ENABLE){
			//printf("RM node Id: %d, cycle: %u, wakes up at globalTime: %d  \n",rimeaddr_node_addr.u8[0],cycleCount, get_global_time());
		}
		//ctimer_set(&periodTimer_2,(1*CLOCK_SECOND)-1,device_module_set_period_general_1,NULL);

		//after 1000 ms -> off Radio and CPU to save energy
		ctimer_set(&turnOffCPUAndRadioTimer,1*CLOCK_SECOND,device_module_save_power,NULL);


		rtimer_clock_t rtime_now;
		rtime_now = RTIMER_NOW();
		//printf("RM node Id: %d wakes up at globalTime: %u \n",rimeaddr_node_addr.u8[0],rtime_now);

	}


#endif /*RM_SCD*/




static void broadcast_recv(struct broadcast_conn *c, const linkaddr_t *from)
{

	struct header_str *header = (struct header_str *)packetbuf_dataptr();
	uint8_t frameType = header->frameType;
#if HD_SCD
	if(DEBUG_ENABLE)
	{

	}
	if(frameType == PMS_ADV_TIME_SYN)
	{
		struct pms_message_adv_time_syn *messagePkt;
		messagePkt = (struct pms_message_adv_time_syn*) packetbuf_dataptr();
		if(DEBUG_ENABLE)
		{
			printf("HD_SCD %d receives PMS_ADV_TIME_SYN from PMS_SCD node %d \n",
					linkaddr_node_addr.u8[0],messagePkt->nodeId);
		}

		//
		ctimer_stop(&periodTimer_1);
		ctimer_set(&periodTimer_1, messagePkt->startSynTime-get_global_time(), device_module_set_period_first, NULL);
		//TurnOFFCC2420(); // for cc2420
		//call function to turn off radio for chip CC2630

	}
#endif

#if RM_SCD
	if(frameType == HD_ROOM_STATUS)
	{
		/*
		struct hd_message_str *messagePkt;
		messagePkt = (struct hd_message_str*) packetbuf_dataptr();
		if(DEBUG_ENABLE)
		{
			printf("RM_SCD %d receives HD_ROOM_STATUS from HD node %d, room_status: %d \n",
					rimeaddr_node_addr.u8[0],messagePkt->nodeId,messagePkt->roomStatus);
		}
		if(rm_room_status == 1 && messagePkt->roomStatus == 2)
		{
			// call IR function to turn off device
			//TurnOffSS();
			// call function to send command to ask PMS_SCD to cut off stanby power
			//device_module_RM_send_command_to_PMS(RM_COMMAND_OFF_REQ);
		}
		rm_room_status = messagePkt->roomStatus;

		*/

	}
	else if(frameType == PMS_COMMAND_IR_ON_REQ)
	{
		/*struct pms_command_message_str *messagePkt;
		messagePkt = (struct pms_command_message_str*) packetbuf_dataptr();

		// call IR function to turn on device
		int i;
		for(i=0;i<5;i++)
		{
			SetTemp27(Hauzen);
		}

		device_module_RM_send_ACK_to_PMS(RM_ACK_ON);
		if(DEBUG_ENABLE)
		{
			printf("RM_SCD %d receives PMS_COMMAND_IR_ON_REQ from PMS node %d \n",
					rimeaddr_node_addr.u8[0],messagePkt->nodeId);
		}
		*/
	}
	else if(frameType == PMS_COMMAND_IR_OFF_TV_REQ)
	{
		// call function to turn off TV
		//printf("turn off TV all\n");
		//device_module_RM_send_IR_notification();
		//device_module_RM_send_ACK_to_PMS(RM_ACK_OFF);
		//printf("Send ack ok \n");

		//TVControl();

		//printf("TV Control OK 1\n");

		//ctimer_set(&ctimer_turn_off_air, 10*CLOCK_SECOND,ctimer_turn_off_expiration_func,NULL);
		//printf("TV Control OK 2\n");
	}
	else if(frameType == PMS_COMMAND_IR_OFF_AIR_REQ)
	{
		// call function to turn off AIR
		//printf("turn off AIR all\n");

		//device_module_RM_send_ACK_to_PMS(RM_ACK_OFF);

		//device_module_RM_send_IR_notification();
		//TVControl();

		//ctimer_set(&ctimer_turn_off_air, 5*CLOCK_SECOND,ctimer_turn_off_expiration_func,NULL);
		//printf("TV Control OK 2\n");
	}
	else if(frameType == PMS_COMMAND_IR_ON_AIR_REQ)
	{
		//SetTemp27(Hauzen);
		//device_module_RM_send_ACK_to_PMS(RM_ACK_ON);
	}
	else if(frameType == PMS_COMMAND_IR_ON_TV_REQ)
	{
		// call function to turn on TV
		//TVControl();

		//ctimer_set(&ctimer_turn_on_air, 10*CLOCK_SECOND,ctimer_turn_on_expiration_func,NULL);

