chitrung218ulsan/contiki-pms-project/core/net/rime/device-module-cc26xx.c
		//device_module_RM_send_ACK_to_PMS(RM_ACK_ON);
	}
	else if(frameType == PMS_ADV_TIME_SYN)
	{
		struct pms_message_adv_time_syn *messagePkt;
		messagePkt = (struct pms_message_adv_time_syn*) packetbuf_dataptr();

		ctimer_stop(&periodTimer_1);

		ctimer_set(&periodTimer_1, messagePkt->startSynTime-get_global_time(), device_module_set_period_first, NULL);

		//TurnOFFCC2420();
		// Turn off Radio chip
		//

		if(DEBUG_ENABLE)
		{
			printf("RM_SCD %d receives PMS_ADV_TIME_SYN from PMS_SCD node %d \n",
					linkaddr_node_addr.u8[0],messagePkt->nodeId);
		}
	}
#endif /*RM_SCD*/

#if PMS_SCD

	if(DEBUG_ENABLE)
	{

	}
	/*if(frameType == HD_ROOM_STATUS)
	{
		struct hd_message_str *messagePkt;
		messagePkt = (struct hd_message_str*) packetbuf_dataptr();
		pms_hd_NodeId = messagePkt->nodeId;
		if(messagePkt->roomStatus == 2)
		{
			// call IR function to turn off device
			//TurnOffSS();
			// call function to send command to ask PMS_SCD to cut off stanby power
			//device_module_RM_send_command_to_PMS(RM_COMMAND_OFF_REQ);

			//if connecting with device without remote
			if(!(PMC_SCD.Status == STANDBY || PMC_SCD.Status == OPERATING|| PMC_SCD.Status == MEASURING))
			{
				printf("PMC receive HD turn off command, do nothing at status %d\n", PMC_SCD.Status);
				return;
			}
#if PMS_SCD_NO_REMOTE
			printf("turn off Device without remote \n");
			ProcessCutOffMode();
#endif


			//if connecting with device having remote

			//send command to RM to off device and cutoff
#if PMS_SCD_REMOTE_TV

			device_module_PMS_send_command_to_RM(PMS_COMMAND_IR_OFF_TV_REQ);
#endif

#if PMS_SCD_REMOTE_AIR

			//device_module_PMS_send_command_to_RM(PMS_COMMAND_IR_OFF_AIR_REQ);

			//set timer to cut off air since the air is turned off by TV PMS
			ctimer_set(&ctimer_turn_off_air_at_pms,13*CLOCK_SECOND,ctimer_turn_off_air_exp_func,NULL);
#endif

		}
		pms_room_status = messagePkt->roomStatus;

		if(DEBUG_ENABLE)
		{
			printf("PMS_SCD %d receives HD_ROOM_STATUS from HD node %d, room_status:%d \n",
					rimeaddr_node_addr.u8[0],hd_NodeId,room_status);
		}
	}*/
	/*else if(frameType == RM_COMMAND_OFF_REQ)
	{
		struct rm_message_str *messagePkt;
		messagePkt = (struct rm_message_str*) packetbuf_dataptr();
		if(DEBUG_ENABLE)
		{
			printf("PMS_SCD %d receives RM_COMMAND_OFF_REQ from RM node %d to cut off standby power \n",
					rimeaddr_node_addr.u8[0],messagePkt->nodeId);
		}
		// check if PMS_SCD connects with device having remote
		// before cutoff
		ProcessCutOffMode();
	}
	else if(frameType == RM_ACK_OFF)
	{
		struct rm_message_str *messagePkt;
		messagePkt = (struct rm_message_str*) packetbuf_dataptr();
		if(DEBUG_ENABLE)
		{
			printf("PMS_SCD %d receives ACK for off device from RM node %d \n",
					rimeaddr_node_addr.u8[0],messagePkt->nodeId);
		}
		ctimer_stop(&rm_ack_timer);
		pms_send_count = 0;

		//ProcessCutOffMode();

	}

	else if(frameType == RM_ACK_ON)
	{
		ctimer_stop(&rm_ack_timer);
		pms_send_count = 0;
		if(DEBUG_ENABLE)
		{
			struct rm_message_str *messagePkt;
			messagePkt = (struct rm_message_str*) packetbuf_dataptr();
			printf("PMS_SCD %d receives ACK for on device from RM node %d \n",
					rimeaddr_node_addr.u8[0],messagePkt->nodeId);
		}
	}
	*/
	else if(frameType == RM_SENDING_IR)
	{

	}
#endif /*PMS_SCD*/


#if SRT_SCD
	if(DEBUG_ENABLE)
	{

	}
#endif

}

void device_module_open()
{
	broadcast_open(&broadcast, 150, &module_device_broadcast_call);
	nullrdc_pms_count_sent = 0;

	int i = 0;

	uint32_t battery_voltage ;

	device_module_get_battery_voltage(&battery_voltage);

	printf("Current battery voltage: %d \n",battery_voltage);

#if RM_SCD

	cycleCount = 0;
#endif

#if PMS_SCD || TEST_CODE
	printf("PMC SCD Start Module \n");
	//flag_turn_on_wait_to_ack = 0;
	onCommand = 0;
	offCommand = 0;
	cycleCount = 0;
	synSeq = 0;
	// send global time syn message
	device_module_pms_send_adv_time_syn();
#endif /* PMS_SCD */



#if HD_SCD
	printf("Human Detection Sensor Start \n");
	process_start(&MW_check_process,NULL);
	cycleCount = 0;
	//process_start(&FFT_process,NULL);
	//process_start(&ADC_process,NULL);
	/*for(i=0;i<MW_FFT_SIZE;i++)
	{
		HD_MWre[i] = 0;
		HD_MWre[i] = 0;
	}*/
	device_module_curState = E_STATE;
	device_module_HD_check = 5;
	device_module_MW_is_checking = 0;

	//ctimer_set(&periodTimer, 1*CLOCK_SECOND,device_module_set_period_general,NULL);
#endif

}

/*
 * Function: Turn off Radio chip
 */

void device_module_turn_off_Radio()
{
	NETSTACK_RADIO.off();
}

void device_module_turn_on_Radio()
{
	NETSTACK_RADIO.on();
}

void device_module_save_power()
{
	device_module_turn_off_Radio();
}

void device_module_get_battery_voltage(uint32_t *battery_voltage)
{
	 ti_lib_aon_batmon_enable();
	 *battery_voltage =ti_lib_aon_batmon_battery_voltage_get();
	 ti_lib_aon_batmon_disable();

}
